<?php

namespace PHPCleanup\Filters;

class RemoveAccentedCharacters extends AbstractFilter {

    public function sanitize($value)
    {
        return str_replace(['á','Á','à','À','â','Â','ä','Ä','ã','Ã','å','Å','ç','Ç','é','É','è','È','ê','ë','Ê','Ë','í','Í','ì','Ì','î','Î','ï','Ï','ñ','Ñ','ó','Ó','ò','Ò','ô','Ô','ö','Ö','õ','Õ','ú','Ú','ù','Ù','û','Û','ü','Ü','´','`','^','~','¨','º'],
        ['a','A','a','A','a','A','a','A','a','A','a','A','c','C','e','E','e','E','e','e','E','E','i','I','i','I','i','I','i','I','n','N','o','O','o','O','o','O','o','O','o','O','u','U','u','U','u','U','u','U','','','','','',''],
        $value);
    }
}